/*
	* IDE(통합 개발 환경)
	공통된 개발자 툴을 하나의 그래픽 사용자 인터페이스(GUI)로 결합하는 프로그램을 구축하기 위한 소프트웨어

	* IDE의 구성요소
	소스코드 편집기(인텔리센스) : 문법검사, 자동완성 기능
	디버깅 : 코드의 흐름 및 값을 검사하여 오류를 찾는 기능
	컴파일러 : 고급언어를 CPU가 이해할 수 있는 저급언어로 번역

	* C++ 컴파일러 (면접에서 물어볼 가능성)
	1. GNU에서 지원하는 GCC        - 오래되었고 안정적이며 많은 언어와 아키텍처(플랫폼에 맞는 설계)에 호환되지만 메모리 사용량이 많다. 리눅스에서 추천하는 컴파일러
	2. LLVM에서 지원하는 Clang     - C언어에 특화된 컴파일러, GCC에 비해 컴파일 속도가 빠르고 메모리 사용량이 적지만 적은 언어를 지원한다.
	3. Microsoft에서 지원하는 MSVC - C언어를 지원하지 않는다. C++언어가 일부 C언어 문법을 포함하기에 C언어 코드를 실행할 수 있다. 일부 C언어 문법은 사용 불가능하다.
	


*/
